simplecube-nosolarload/constant/cube/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/cube/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    plusx
    {
        type            patch;
        nFaces          900;
        startFace       38700;
    }
    plusy
    {
        type            patch;
        nFaces          450;
        startFace       39600;
    }
    plusz
    {
        type            patch;
        nFaces          450;
        startFace       40050;
    }
    miny
    {
        type            patch;
        nFaces          450;
        startFace       40500;
    }
    minz
    {
        type            patch;
        nFaces          450;
        startFace       40950;
    }
    cube_to_space
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          900;
        startFace       41400;
        sampleMode      nearestPatchFace;
        sampleRegion    space;
        samplePatch     space_to_cube;
    }
)

// ************************************************************************* //
