simplecube-nosolarload/system/space/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    ".*"
    {
        inGroups        2(wall viewFactorWall);
    }
}

T
{
    internalField   uniform 0;
    boundaryField
    {
        ".*"
        {
            type            fixedValue;
            value           uniform 0;
        }

        minX
        {
            type            fixedValue;
            value           uniform 300;
        }
        maxX
        {
            type            inletOutlet;
            inletValue      uniform 300;
            value           uniform 300;
        }

	space_to_cube
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            qrNbr           none;
            qr              qr;
            value           uniform 0;
        }
    }
}

qr
{
    internalField   uniform 0;
    boundaryField
    {
        ".*"
        {
            type            greyDiffusiveRadiationViewFactor;
            emissivityMode  lookup;
            qro             uniform 0;
            emissivity      uniform 1.0;
            value           uniform 0;
        }

        space_to_cube
        {
            type            greyDiffusiveRadiationViewFactor;
            emissivityMode  solidRadiation;
            qro             uniform 1400;
            value           uniform 0;
        }
    }
}


// ************************************************************************* //
