simplecube-nosolarload/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // cube
    {
        name    cubeCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (1 0 0)(2 2 2);
    }
    {
        name    cube;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     cubeCellSet;
    }

    // Space
    {
        name    spaceCellSet;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     cubeCellSet;
    }
    {
        name    spaceCellSet;
        type    cellSet;
        action  invert;
    }
    {
        name    space;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     spaceCellSet;
    }
);


// ************************************************************************* //
